import bmwLoverIcon from '../images/characters/bmw-lover.png';
import chatterboxIcon from '../images/characters/chatterbox.png';
import coffeeAddictIcon from '../images/characters/coffee-addict.png';
import foodieIcon from '../images/characters/foodie.png';
import geekIcon from '../images/characters/geek.png';
import jokerIcon from '../images/characters/joker.png';
import schedulerIcon from '../images/characters/scheduler.png';
import workaholicIcon from '../images/characters/workaholic.png';

export const CATEGORIES = {
  FUN: 'fun',
  STRICT: 'strict',
};

const CHARACTERS = {
  OFFICE_JOKER: {
    key: 'OFFICE_JOKER',
    title: 'Office Joker',
    category: CATEGORIES.FUN,
    description:
      'Ти міг би стати стендап коміком, проте навіщо ходити на вільні мікрофони якщо можеш перевіряти свій матеріал не виходячи з офісу? У тебе на всі випадки життя знайдеться фраза “То як в тому анекдоті…”, на телефоні в галереї буде окрема папка з мемами, а тік-ток підкидує чомусь одні пранки. Та головне, що ти завжди використовуєш свої супер-сили тільки во ім’я добра та хорошого настрою (ну окей, майже завжди) ',
    pros: 'Ти знаєш з якої фрази розпочати знайомство з newcomer',
    cons: 'Отой останній анекдот про українця, німця і француза був зайвим',
    icon: jokerIcon,
  },
  COFFEE_ADDICTED: {
    key: 'COFFEE_ADDICTED',
    title: 'Coffee Adicted',
    category: CATEGORIES.FUN,
    description:
      'Твій день починається тільки з кави, а потім ти не можеш підрахувати скільки літрів її випив (по секрету, кава не входить в денну норму води, перестань її трекати). Тобі байдуже флет-вайт, фільтр чи ванілакармелатте, лиш би кофеїн потрапив у твій організм! Здається, що кава чи вода у машинці закінчується тільки на тобі. Ти ніколи не губиш своє горнятко і коли не можеш його знайти поруч переживаєш більше, ніж коли не нащупуєш телефон в кишені.',
    pros: 'Ти не проти зустрітися з будь-ким із друзів, аби лиш “на каву”',
    cons: 'Колись твій організм змусить тебе перейти на каву без кофеїну',
    icon: coffeeAddictIcon,
  },
  FOODIE: {
    key: 'FOODIE',
    title: 'The Foodie',
    category: CATEGORIES.FUN,
    description:
      'Уся гастрономія цього світу схиляється до твоїх ніг, бо тільки ти знаєш, що це не тільки про їжу але й про спосіб самовираження. Тому твої фрази “го їсти!”, “замовимо щось сьогодні?!” чи найбанальніше “може в Каютку?!” завжди знаходить відголос! Бо, хто як не ти знає про всі можливі акції, де кожна третя піца йде в подарунок, де найсмачніші суші та куди вже завтра можна піти на традиційні ранки - сніданки! А ще, ти з легкістю переконаєш будь-якого Гіка, що до першої кави чи чаю смакують тільки пончики з “Родинної ковбаски”.',
    pros: 'Твоя їжа завжди найсмачніша!',
    cons: 'Вже не залишилося суто «твоїх» закладів, адже Ти занадто багато рекомендуєш і ділишся',
    icon: foodieIcon,
  },
  CHATTERBOX: {
    key: 'CHATTERBOX',
    title: 'The Chatterbox',
    category: CATEGORIES.FUN,
    description:
      'Саме ти тримаєш вкурсі увесь офіс про фіналістів шоу “Голос країни - діти”, ти знаєш, що означає “сокіабле” та хто вилетів на останній “церемонії роз”. Та не захоплюйся! Змирися з думкою, що не кожен народжений для мультитаскінгу і не може (чомусь) водночас закривати тікети та обговорювати останні серіали з нетфліксу.',
    pros: 'Ти за словом в кишеню не полізеш',
    cons: 'Ти за словом в кишеню не полізеш',
    icon: chatterboxIcon,
  },
  WORKAHOLIC: {
    key: 'WORKAHOLIC',
    title: 'The Workaholic',
    category: CATEGORIES.STRICT,
    description:
      'Якщо ти знімаєш офіс з сигналки і пишеш в #random “Є ще хтось в офісі?” не отримуючи жодного плюса в реакціях, а колеги впізнають тебе частіше з политиці, аніж з лиця, тоді ти точно workaholic! Тебе бісять люди, які занадто часто ходять по каву або які використовують усі 18 днів відпустки і ще дейоффами заправляють. Easy Tiger, ми любитимемо тебе навіть більше якщо ти дозволиш собі трохи відпочити. ',
    pros: 'Ти незамінний/а на своєму проєкті!',
    cons: 'Тобі важко по фотці в слаці співставити людей оффлайн',
    icon: workaholicIcon,
  },
  SCHEDULER: {
    key: 'SCHEDULER',
    title: 'The meeting scheduler',
    category: CATEGORIES.STRICT,
    description:
      'Якщо ти не розумієш чому тобі випала ця категорія - просто відкрий свій календар. Складається враження, що ти у ньому граєш сапера, і якщо буде оверлап двох мітингів то вибухне бомба! Ти букаєш все - від ретроспективи до грумінгу собачки, від f2f до квартальної сплати податків. Хто би що не казав, але плануєш як боженька!',
    pros: 'Повністю заповнений календар - це найкраще алібі.',
    cons: 'Навіть, якщо твій календар складається на 80% з води, він все одно якісно вирізняється на фоні календарів половини твоєї команди.',
    icon: schedulerIcon,
  },
  GEEK: {
    key: 'GEEK',
    title: 'True Geek',
    category: CATEGORIES.STRICT,
    description:
      'У тебе є весь мерч, стартуючи від олівця та наклейки з першого робочого дня, ти не пропускаєш жодного івенту та береш активну участь у житті компанії. Ти перший/а заповнюєш усі доки, ставиш реакції на повідомлення та раз на тиждень тегаєш KindGeek у соцмережах. Ти знаєш більшість Гіків в лице, навіть якщо вони в компанії менше місяця.',
    pros: 'Ти випромінюєш дух компанії!',
    cons: 'На своє весілля ти не зможеш вдягнути пуловер KindGeek (хоча хто зна?)',
    icon: geekIcon,
  },
  BMW: {
    key: 'BMW',
    title: 'BMW Lover',
    category: CATEGORIES.STRICT,
    description:
      'На твоїй майці один із найвдаліших автомобільних логотипів в історії графічного дизайну. На твоїх джінсах Німецький чорно-червоно-жовтий прапор, серед 5-ти машин на дорозі, ти помічаєш тільки її одну, поважаєш інші марки, але відкладаєш гроші на власний Бумер. Ти знаєш, що в цьому світі ніхто не досконалий, але якщо ти їздиш за кермом BMW, то ти близький/ка до цього.',
    pros: 'Не всі у цьому світі такі ж поціновувачі BMW, як ти, але серед Гіків у тебе завжди є однодумці.',
    cons: 'Якщо ти на польських бляхах, то це не BMW',
    icon: bmwLoverIcon,
  },
};

export default CHARACTERS;
