import bayraktarImage from '../images/weapons/bayraktar.png'
import javelinImage from '../images/weapons/javelin.png'
import mi8Image from '../images/weapons/mi8.png'
import su27Image from '../images/weapons/su27.png'
import ak47Image from '../images/weapons/ak47.png'
import molotovImage from '../images/weapons/molotov.png'
import gooseImage from '../images/weapons/goose.png'
import cucumberImage from '../images/weapons/cucumber.png'
import gopnikImage from '../images/weapons/gopnik.png'
import traktorImage from '../images/weapons/traktor.png'

export const CATEGORIES = {
  STRICT: 'strict',
  FUN: 'fun',
};

const WEAPONS = {
  BAYRAKTAR: {
    key: 'BAYRAKTAR',
    title: 'Байрактар ТБ2',
    category: CATEGORIES.STRICT,
    description: 'Або як ще називають Тебе друзі - "прапороносець". Ти ведеш розвідку і вдень і вночі, готовий знищувати ворожі танки та гради, як Галичани траву навесні.\nСкоріш за все Ти той, хто у своєму віш-листі до найближчого свята уже загадав, щоб по усій території псевдо-братнього народа найближче десятиліття щоночі звучала "Повітряна тривога - усім в укриття!"',
    image: bayraktarImage
  },
  JAVELIN: {
    key: 'JAVELIN',
    title: 'FGM-148 "Джавелін"',
    category: CATEGORIES.STRICT,
    description: 'Ти призначений/а для враження бронетехніки, укріплень на землі, а також деяких літальних об\'єктів, що переміщуються на низькій висоті й швидкості — гелікоптерів або БПЛА.\nЗ тим як Ти міцно та впевнено тримаєшся у цій війні, як допомагаєш іншим та скільки звитяг Ти вже здобув, Netflix, скоріш за все, присвятить Тобі окремий проєкт, а руска пропагандистьска машина називатиме таких як Ти нєофашісткім арудієм (ну хіба ж не пробиває на сльозу?)',
    image: javelinImage
  },
  MI8: {
    key: 'MI8',
    title: 'Mi8',
    category: CATEGORIES.STRICT,
    description: 'Так само як і славнозвісний Мі-8, який є одним з наймасовіших вертольотів в історії авіації та працює на всіх можливих фронтах (як військових, так і цивільних) у Тобі поєднано дуже багато особистостей! \nТи водночас можеш вийти і в поле бою, і надати першу медичну допомогу, підтримати того, кому зараз морально складно, а в мирний час працювати на благо своєї найріднішої країни! \nТак тримати!\n Усе тривається на таких універсальних солдатах як Ти!',
    image: mi8Image
  },
  SU27: {
    key: 'SU27',
    title: 'Су-27',
    category: CATEGORIES.STRICT,
    description: 'Ти як багатоцільовий високоманевровий всепогодний винищувач четвертого покоління СУ-27 - жодні проблеми та незгоди, не роблять Тобі в житті нєрвів.\n Навпаки!  \nВони Тебе ще більше розпалюють та стають рушійною силою! Ти готовий боротися з ворогом невпинно, all day - all night та спокійно, ніби Тебе супроводжує голос Арестовича.',
    image: su27Image
  },
  AK47: {
    key: 'AK47',
    title: 'Автомат Калашнікова',
    category: CATEGORIES.STRICT,
    description: 'Ти надійни та простий - можеш знайти спільну мову із будь-ким і завжди знайдеш неспростовні аргументи у будь-якому конфлікті. \nТи знаєш практично усіх і Твої скіли також дають Тобі домовитися з тим, з ким требаі “пробити” найдефіцитніший дефіцит. Бронік? Дайте два! \nТак тримати - Ти наш герой!',
    image: ak47Image
  },
  MOLOTOV: {
    key: 'MOLOTOV',
    title: 'Коктейль Молотова',
    category: CATEGORIES.FUN,
    description: 'Хтось скаже, що Ти найпростіша саморобна запалювальна зброя. Ми ж вважаємо Тебе справжнім партизаном та символом революції. Ти надійний тил, який прямим текстом каже ворогу "не дамо!".\n Займистий, палкий, патріотичний і з любовʼю до напоїв, які раніше наповнювала Твої Бандера-смузі ❤️',
    image: molotovImage
  },
  GOOSE: {
    key: 'GOOSE',
    title: 'Гусь з біолабораторії',
    category: CATEGORIES.FUN,
    description: 'Ти жах "хороших рускіх", до таких як Ти прикуті погляди мільйонів через zомбоящики рф. Якщо в Тобі і є щось секретне американське - то це хороший рівень англійської, який дозволяє Тобі руйнувати міфи та стереотипи про події довкола у головах світової спільноти. Інформаційна війна - це Ти, а ще можливо кілька ненавʼязливих пернатих тік-токів ',
    image: gooseImage
  },
  CUCUMBER: {
    key: 'CUCUMBER',
    title: 'Банка огірків',
    category: CATEGORIES.FUN,
    description: 'Твоя сила в тому - щоб залишатися собою, бути на своєму місці і при цьому водночас робити все для спільної перемоги. Ти приклад того, як кожен українець творить нову історію та нову державу. Хтось відбиває атаки автоматами, хтось клавіатурою, а хтось відбірними закрутками! Ну що, скільки дронів Ти вже збив, а?',
    image: cucumberImage
  },
  GOPNIK: {
    key: 'GOPNIK',
    title: 'Гопник з Оболоні',
    category: CATEGORIES.FUN,
    description: '"Танк є? А якщо найду?" \nТи наш надійний “страж” порядку! Мимо Тебе не пройде жоден диверсант, жодна мітка не сховається, а бойова техніка не прокрадеться! Адже як воно може десь дітись, якщо це можна перевести в кеш і зразу на потреби ЗСУ?',
    image: gopnikImage
  },
  TRAKTOR: {
    key: 'TRAKTOR',
    title: 'Трактор радикального фермера',
    category: CATEGORIES.FUN,
    description: 'Ти не професійно вишколений воїн, який створений для того аби вбивати - проте Твоїй завзятості та любові до України може позаздрити будь-який солдат. Ти мовчки ідеш і робиш свою роботу - і робиш її так, що вороги вже кидаються навтьоки щойно ти зʼявляєшся на горизонті!',
    image: traktorImage
  }
}

export default WEAPONS;
